Revit 2027 API
Application.DefaultProjectTemplate Property
 Full path to the default template file for new project documents.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DefaultProjectTemplate { get; }
Public ReadOnly Property DefaultProjectTemplate As String
	Get
public:
property String^ DefaultProjectTemplate {
	String^ get ();
}
member DefaultProjectTemplate : string with get
Property Value
String
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace